app/controllers/radios_controller.rb

  def index
    @radios = Radio.all
---
SELECT "radios".* FROM "radios"

  def show
    @radio = Radio.find(params[:id])
---
SELECT  "radios".* FROM "radios" WHERE "radios"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @radio = Radio.find(params[:id])
---
SELECT  "radios".* FROM "radios" WHERE "radios"."id" = ? LIMIT 1  [["id", 6]]

  def create
    @radio = Radio.new(radio_params)

    @radio.save
---
INSERT INTO "radios" ("name", "source", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "nombre"], ["source", "fuente"], ["created_at", "2015-07-20 10:34:19.172208"], ["updated_at", "2015-07-20 10:34:19.172208"]]

  def update
    @radio = Radio.find(params[:id])

    if @radio.update(radio_params)
---
SELECT  "radios".* FROM "radios" WHERE "radios"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "radios" SET "source" = ?, "updated_at" = ? WHERE "radios"."id" = ?  [["source", "radioooo2"], ["updated_at", "2015-07-20 11:19:09.727710"], ["id", 6]]